In [24]:
#Question-1

a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [7]:
b()

In [8]:
b()

In [9]:
b()

In [10]:
a

6

In [12]:
#Question-2

def file_length(file_name):
  try:
    file = open(file_name)
    contents = file.read()
    file.close()
    print(len(contents))
  except FileNotFoundError as err:
    print(f"File not exist with the name {file_name}")

In [13]:
file_length("Filelength.txt")

123

In [14]:
#Question-3

class Marsupial:
    data = []
    def put_in_pouch(self,item, data = data):
        self.item = item
        data.append(self.item)
    
    def pouch_contents(self, data = data):
        return data

m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [19]:
class kangaroo(Marsupial):
    def __init__(self,x,y):
        self.xinp=x
        self.yinp=y
    def jump(self,dx,dy):
        self.xinp+=dx
        self.yinp+=dy
    def __str__(self):
        return"I am Kangaroo located at "+ "("+str(self.xinp)+","+str(self.yinp) +")"

In [20]:
k = kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

I am Kangaroo located at (0,0)

['doll',
 'firetruck',
 'kitten',
 'doll',
 'firetruck',
 'kitten',
 'doll',
 'firetruck',
 'kitten',
 'doll',
 'firetruck',
 'kitten']

In [21]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am Kangaroo located at (3,0)

In [22]:
#Question-4

def collatz(num):
  if num != 1:
    if num % 2 == 0:
      print(num)
      num = num//2
      collatz(num)
    else:
      print(num)
      num = 3*num + 1
      collatz(num)
  if num == 1:
    print(num)
    exit()
    
collatz(10)

10
5
16
8
4
2
1
1

In [1]:
#Question-5

def binary(num):
  print(f"{num:b}")

binary(9)

# binary(0)
# binary(1)
# binary(3)
# binary(9)

1001

In [2]:
#Question-6

from html.parser import HTMLParser
class HeadingParser(HTMLParser):
  inHeading = False
  count = -1
  l = []

  def handle_starttag(self, tag, attrs):
    if tag in ("h1","h2","h3","h4","h5","h6"):
      self.inHeading = True
      self.count += 1

  def handle_data(self, data):
    if self.inHeading:
      if data.lstrip().rstrip().strip() != '':
        print(" "*self.count+data.lstrip().rstrip().strip())

  def handle_endtag(self, tag):
    if tag in ("h1","h2","h3","h4","h5","h6"):
      self.inHeading = False


infile = open('w3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)

W3C Mission
 Principles

In [29]:
#Question-7

#ReferenceLink(https://www.geeksforgeeks.org/python-program-to-recursively-scrape-all-the-urls-of-the-website/)

#pip install requests
#pip install beautifulsoup4

from bs4 import BeautifulSoup
import requests

links=[]
   
def website(imp):
       
    xyz = requests.get(imp)
       
    abc = BeautifulSoup(xyz.text,"html.parser")
       
    for z in abc.find_all("a"):
          
        href = z.attrs['href']
           
        if href.startswith("/"):
            imp = imp+href
               
            if imp not in links:
                links.append(imp) 
                print(imp)
                website(imp)
   
if __name__ =="__main__":
   
    imp="http://reed.cs.depaul.edu/lperkovic/csc242/test4.html"
    website(imp)

In [25]:
#Question-8

%load_ext sql
%sql sqlite:///

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [7]:
%%sql
CREATE TABLE data(
    city varchar(30),
    country varchar(30),
    season varchar(30),
    temperature float(10),
    rainfall  float(10)
);

 * sqlite:///
Done.

[]

In [8]:
%%sql
INSERT INTO data VALUES
('Mumbai','India', 'winter','24.8','5.9'),
('Mumbai','India', 'spring','28.4','16.2'),
('Mumbai','India', 'Summer','27.9','1549.4'),
('Mumbai','India', 'fall','27.6','346.0'),
('London','United Kingdom','winter','4.2','207.7'),
('London','United Kingdom','sping','8.3','169.6'),
('London','United Kingdom','summer','15.7','157.0'),
('London','United Kingdom','fall','10.4','218.5'),
('Cairo','Egypt', 'winter','13.6','16.5'),
('Cairo','Egypt', 'spring','20.7','6.5'),
('Cairo','Egypt', 'summer','27.7','0.1'),
('Cairo','Egypt', 'fall','22.2','4.5');

 * sqlite:///
12 rows affected.

[]

In [9]:
%sql select * from data;

 * sqlite:///
Done.

[('Mumbai', 'India', 'winter', 24.8, 5.9),
 ('Mumbai', 'India', 'spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'sping', 8.3, 169.6),
 ('London', 'United Kingdom', 'summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'fall', 22.2, 4.5)]

In [10]:
#Question-8(a)

%sql select temperature from data;

 * sqlite:///
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

In [11]:
#Question-8(b)

%sql select distinct city from data;

 * sqlite:///
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [12]:
#Question-8(c)

%sql select * from data where country = 'India';

 * sqlite:///
Done.

[('Mumbai', 'India', 'winter', 24.8, 5.9),
 ('Mumbai', 'India', 'spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'fall', 27.6, 346.0)]

In [13]:
#Question-8(d)

%sql select * from data where season ='fall';

 * sqlite:///
Done.

[('Mumbai', 'India', 'fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'fall', 22.2, 4.5)]

In [14]:
#Question-8(e)

%sql select City, country, season from data where rainfall > 200 AND rainfall < 400;

 * sqlite:///
Done.

[('Mumbai', 'India', 'fall'),
 ('London', 'United Kingdom', 'winter'),
 ('London', 'United Kingdom', 'fall')]

In [15]:
#Question-8(f)

%sql select city, country from data where season = 'fall' And temperature > 20 ORDER BY temperature;

 * sqlite:///
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [16]:
#Question-8(g)

%sql select sum(rainfall) from data where city = 'Cairo';

 * sqlite:///
Done.

[(27.6,)]

In [17]:
#Question-8(h)

%sql select sum(rainfall) from data group by season;

 * sqlite:///
Done.

[(1549.4,), (569.0,), (169.6,), (22.7,), (157.1,), (230.1,)]

In [23]:
#Question-9

# a)
def cap(lis):
  if len(lis) != 0:
    return [str(i).upper() for i in lis]
  return -1

# b)
def small(lis):
  if len(lis) != 0:
    return [str(i).lower() for i in lis]
  return -1

# c)
def length(lis):
  if len(lis) != 0:
    return [len(i) for i in lis]
  return -1

# d)
def all_in_one(lis):
  if len(lis) != 0:
    return [[str(i).upper(),str(i).lower(),len(i)] for i in lis]
  return -1

# e)
def list_of_words(lis):
  if len(lis) != 0:
    return [str(i).lower() for i in lis]
  return -1


words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

print(cap(words))
print(small(words))
print(length(words))
print(all_in_one(words))
print(list_of_words(words))

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']